// 2)კომენტარის სახით ახსენით თუ რა არის global scope

// 3)კომენტარის სახით ახსენით თუ რა არის local variables და როგორი ცვლადები არიან ისინი

// 4)კომენტარის სახით ახსენით თუ რა არის global variables და როგორი ცვლადები არიან ისინი

// 5)კომენტარის სახით ახსენით თუ რა არის namespace]

// 6)კომენტარის სახით ახსენით თ რა არის scope pollution

// 7)დაწერე კოდი, სადაც არის:

// ერთი global ცვლადი

// ორი block scope ცვლადი (ერთი if ბლოკში და მეორე for ციკლში)

// შენი დავალებაა

// console.log–ით გამოიტანე ყველა ცვლადი ბლოკის გარეთ და ნახე შედეგი

// 8)ამას შემდეგზე ავსნით მაგრამ შეამოწმეთ ==>

// if (true) {
//   var a = 5;
//   let b = 10;
// }
// console.log(a);
// console.log(b);

// ნახეთ:

// რომელი და რატომ დაბეჭდავს?

// რომელი არ დაიბეჭდება?

// 9)let y = 5;

// {
//   let y = 15;
//   console.log(y);
// }

// console.log(y);

// რატომ არის პირველ და მეორე console.log-ის შედეგი განსხვავებული?


// 10)let z = 1;

// function test() {
//   let z = 2;
//   console.log(z);
// }

// test();
// console.log(z);

// რატომ განსხვავდება შედეგი?

// 11)დაწერე:

// for (let i = 0; i < 3; i++) {
//   console.log(i);
// }
// console.log(i);

// console.log(i) ციკლიდან გარეთ რა შედეგს იძლევა და რატომ?

// 12)let name = "Goga";

// function changeName() {
//   name = "Nika";
// }

// changeName();
// console.log(name);

// რა გამოვა და რატომ?


// 13)დაწერე კოდი, სადაც:

// global ცვლადი x = 10

// for ციკლში შექმენი let x = 0 და დააბეჭდე

// ციკლიდან გარეთ დააბეჭდე global x


// 14)დაწერე კოდი, სადაც:

// შექმენი global ცვლადი name

// if ბლოკში შექმენი ცვლადი name და დააწერე სხვა მნიშვნელობა

// დააბეჭდე name ბლოკის გარეთ


//------------------1-------------------
//კომენტარის სახით ახსენით თუ რა არის block scope 

//BLock scope - მაგალითად, ცვლადი რომელიც არის ბლოკის შიგნით შექმნილი და მათი გამოყენება მხოლოდ ამ ბლოკის შიგნით.


//------------------2-------------------
//კომენტარის სახით ახსენით თუ რა არის global scope

//Global scope - მაგალითად, ცვლადი რომელიც არის  შეძლება რომ გამოვიყენოთ კოდის ნებისმიერ ადგილას.


//------------------3-------------------
//კომენტარის სახით ახსენით თუ რა არის local variables და როგორი ცვლადები არიან ისინი

//local variables - ცვლადი რომელიც გამოიყენება მხოლოდ ერთი ბლოკის ფარგლებში.ძირითადად Block - ში შექმნილი ცვლადებია Block სკოუპსი არსებობენ.


//------------------4-------------------
//კომენტარის სახით ახსენით თუ რა არის global variables და როგორი ცვლადები არიან ისინი.

//Global variables - ცვლადი, რომელიც შესაძლოა გამოვიყენოთ კოდის ნებისმიერ ადგლიას. Gloabl სკოუპში არსებობენ.


//------------------5-------------------
//კომენტარის სახით ახსენით თუ რა არის namespace.

//Namespace - არის ადგლილი ჩვენ კოდში რომელიც შეიცავს Gloabl სკოუპის ინფორმაციას.


//------------------6-------------------
//კომენტარის სახით ახსენით თუ რა არის scope pollution.

//Scope pollution - არის როდესაც ძალიან ბევრი ცვლადი გვაქვს ჩვენ Namescpace - ში, ანდ ცვლადები ხელახლა გამოყენებულია ბევრჯერ.


//------------------7-------------------

let Global_varieable = 'Global varieable'

if (Global_varieable == 'Global varieable') {

    let Block_scope = 'Gloabl variable 2'

}

for (let i = 0; i <= 1; i++) {

    let Block_scope_2 = i

}

console.log(Global_varieable) //კონსოლში ჩვეულებრივად გამოიტანს ცვლადის მნიშვნელობას
console.log(Block_scope) //გამოიტანს error - ს
console.log(Block_scope_2) //გამოიტანს error - ს



//------------------8-------------------

if (true) {
    var a = 5
    let b = 10
}
console.log(a)
console.log(b)

//ჩვენ ვხედავთ რომ if Block - ში არის შექმნილი ორი ცვლადი. ერთ-ერთი არის შექმნილი var - ის გამოყენებით და როგორც ჩანს ის Global სკოუპშია, რადგან if ბლოკის გარეთაც შევძლეთ მისი გამოძახება.
//შესაბამისად let ის მეშვეობით შექმნილი ცვლადი არის ბლოკს სკოუპში, ამიტომაც ის if ბლოკის გარეთ არ გამოიყენება.


//------------------9-------------------
// რატომ არის პირველ და მეორე console.log-ის შედეგი განსხვავებული?
let y = 5;

{
    let y = 15;
    console.log(y);
}

console.log(y);

//ისინი განხსხვავებულები არიან რადგან, მეორე ცვლადი Block variable. მისი მნიშვნელობა ბლოკის გარეთ პროგრამისთვის უცნობია, ამოიტომაც ბლოკის შიგნით არის შექმნილი და გამოძახებული.
//მეორე  ცვლადი კი Global variable არის და მისი გამოძახება ნებისმიერ ადგილას შეგვიძლია.რადგანაც Block variable - ის მნიშვნელობა პროგრამამ არ იცის, მან გამოიძახა Global variable.


//------------------10-------------------
//რატომ განსხვავდება შედეგი?

let z = 1;

function test() {
    let z = 2;
    console.log(z);
}

test();
console.log(z);

//ფუნქციის შიგნით არის შექმნილი ცვლადი და გამოძახებული იგი. შემდგლომ როდესაც ჩვენ ფუნქციას გამოვიძახებთ, ამ ცვლადის მნიშვნელონა გამოჩნდება კონსოლში.
//ხოლო მეორე ცვლადი გლობალური არის და ნებისმიერ ანდგილას გამოძახება.


//------------------11-------------------
// console.log(i) ციკლიდან გარეთ რა შედეგს იძლევა და რატომ?

for (let i = 0; i < 3; i++) {
  console.log(i)
}
console.log(i)

//for არის Block, და მასაში შექმნილი ცვლადი (i) არის Block სკოუპში.როგორხ ყველა სხვა Block სკოპის მქონე ცვლადი, BLock - ის გარეთ მისი მნიშვნელობა უცნობია, ამიტომაც error - ს დაწერს კონსოლში.


//------------------12-------------------
//რა გამოვა და რატომ?

let name = "Goga"

function changeName() {
    name = "Nika"
}

changeName()
console.log(name)
//კონსოლში გამოვა მარტო Nika. ფუნქციაში name ცვლადის მნიშვნელობა შეიცვალა, და მერე ეს ფუნქცია გამოიძახეს. ანუ ის შეცვლა გახდა Global - სკოუპში.


//------------------13-------------------
let x = 10

for (let x = 0; x <= 3; x++) {

    console.log(x)

}
console.log(x)


//------------------14-------------------

let name_2 = 'gabo'

if (true) {
    
    let name_2 = 'gabrieli'

}
console.log(name_2)