//ჩვენ ვისწავლეტ ორი ლოგიკური ოპერატორი, && (და) და || (ან). 
//აქედან && ლოგიკური ოპერატორი ამოწმებს თუ არის თუ არა ორივე მოცემული არგუმენტი სწორი.
//ხოლო || ლოგიკური ოპერატორი ამოწმებს თუ არის თუ არე ერთი-ერთი მოცემული ოპერატორი სწორი.

//მაგალითები &&:
//if (1 < 2 && 2 < 3) = True
//if (1 > 2 && 2 > 3) = False
//if (1 > 2 && 2 > 3) = False
//if (1 = 2 && 2 = 3) = False
//if (1 = 1 && 2 = 2) = True

//მაგალითები ||:
//if (1 = 1 || 2 = 2) = True
//if (1 = 1 || 2 = 3) = True
//if (1 = 2 || 2 = 3) = False
//if (True || False) = True
//if (False || Flase) = False


//განსხვავება == და === შორის არის ის რომ, 'მკაცრი ტოლობა' (===) ადარებს არა მარტო ობიექტის შინაარს, არამედ რა ტიპისაა ის.
