// 1) კომენტარებით ახსენით, რა არის scope JavaScript-ში, მოიყვანეთ მაგალითები

// 2) კომენტარებით ახსენით, რა არის hoisting-ი

// 3) ახსენით რატომ არის ცუდი var ის გამოყენება

// 4) ახსენით რა განსხვავებაა აროუ ფუნქციასა და ჩვეულებრივ ფუნქციის შორის


//--------------------1---------------------

//scope JavaScript - ში არის, ცვლადების წვდომილობის აღმანისნებელი ტერმინი.

//არის სამი ტიპის scope: Global,Local, Function scope.

//Global მაგალითი:

// let num = 4
// const num = 4
// var num = 4


//Local მაგალითი:

//function myFunc(){

    //let num = 4

//}

//Function მაგალითი:

//function myFunction1() {
//   var num = 6  
// }

// function myFunction2() {
//   let num = 7  
// }

// function myFunction3() {
//   const num = 12  
// }


//--------------------2---------------------

//hosting არის როდესაც, მაგალითად ფუნქცია, არის გამოძახებული უფრო მაღლა, ვიდრე მისი პირობა

//მაგალითი:
// myFunction()

// function myFunction(){

//     console.log('Hosting is bad')

// }   



//--------------------3----------------------

//var - არის ცვლადის შექმნის ერთ-ერთი გზა.
//მისი გააჩნია რამოდენიმე ნაკლი, ერთ-ერთი მათგანი არის ცვლადის მნიშვნელობის ჩანახვლების სიადვილე.
//კიდევ ერთi პრობლემა არის hosting~